/* automatically generated by rust-bindgen 0.72.1 */

pub const DES_ENCRYPT: u32 = 0;
pub const DES_DECRYPT: u32 = 1;
#[doc = " \\brief          DES context structure"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct des_context {
    #[doc = "<  encrypt/decrypt"]
    pub mode: ::std::os::raw::c_int,
    #[doc = "<  DES subkeys"]
    pub sk: [::std::os::raw::c_ulong; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of des_context"][::std::mem::size_of::<des_context>() - 264usize];
    ["Alignment of des_context"][::std::mem::align_of::<des_context>() - 8usize];
    ["Offset of field: des_context::mode"][::std::mem::offset_of!(des_context, mode) - 0usize];
    ["Offset of field: des_context::sk"][::std::mem::offset_of!(des_context, sk) - 8usize];
};
#[doc = " \\brief          Triple-DES context structure"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct des3_context {
    #[doc = "<  encrypt/decrypt"]
    pub mode: ::std::os::raw::c_int,
    #[doc = "<  3DES subkeys"]
    pub sk: [::std::os::raw::c_ulong; 96usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of des3_context"][::std::mem::size_of::<des3_context>() - 776usize];
    ["Alignment of des3_context"][::std::mem::align_of::<des3_context>() - 8usize];
    ["Offset of field: des3_context::mode"][::std::mem::offset_of!(des3_context, mode) - 0usize];
    ["Offset of field: des3_context::sk"][::std::mem::offset_of!(des3_context, sk) - 8usize];
};
unsafe extern "C" {
    #[doc = " \\brief          DES key schedule (56-bit, encryption)\n\n \\param ctx      DES context to be initialized\n \\param key      8-byte secret key"]
    pub fn des_setkey_enc(ctx: *mut des_context, key: *mut ::std::os::raw::c_uchar);
}
unsafe extern "C" {
    #[doc = " \\brief          DES key schedule (56-bit, decryption)\n\n \\param ctx      DES context to be initialized\n \\param key      8-byte secret key"]
    pub fn des_setkey_dec(ctx: *mut des_context, key: *mut ::std::os::raw::c_uchar);
}
unsafe extern "C" {
    #[doc = " \\brief          Triple-DES key schedule (112-bit, encryption)\n\n \\param ctx      3DES context to be initialized\n \\param key      16-byte secret key"]
    pub fn des3_set2key_enc(ctx: *mut des3_context, key: *mut ::std::os::raw::c_uchar);
}
unsafe extern "C" {
    #[doc = " \\brief          Triple-DES key schedule (112-bit, decryption)\n\n \\param ctx      3DES context to be initialized\n \\param key      16-byte secret key"]
    pub fn des3_set2key_dec(ctx: *mut des3_context, key: *mut ::std::os::raw::c_uchar);
}
unsafe extern "C" {
    #[doc = " \\brief          Triple-DES key schedule (168-bit, encryption)\n\n \\param ctx      3DES context to be initialized\n \\param key      24-byte secret key"]
    pub fn des3_set3key_enc(ctx: *mut des3_context, key: *mut ::std::os::raw::c_uchar);
}
unsafe extern "C" {
    #[doc = " \\brief          Triple-DES key schedule (168-bit, decryption)\n\n \\param ctx      3DES context to be initialized\n \\param key      24-byte secret key"]
    pub fn des3_set3key_dec(ctx: *mut des3_context, key: *mut ::std::os::raw::c_uchar);
}
unsafe extern "C" {
    #[doc = " \\brief          DES-ECB block encryption/decryption\n\n \\param ctx      DES context\n \\param input    64-bit input block\n \\param output   64-bit output block"]
    pub fn des_crypt_ecb(
        ctx: *mut des_context,
        input: *mut ::std::os::raw::c_uchar,
        output: *mut ::std::os::raw::c_uchar,
    );
}
unsafe extern "C" {
    #[doc = " \\brief          DES-CBC buffer encryption/decryption\n\n \\param ctx      DES context\n \\param mode     DES_ENCRYPT or DES_DECRYPT\n \\param length   length of the input data\n \\param iv       initialization vector (updated after use)\n \\param input    buffer holding the input data\n \\param output   buffer holding the output data"]
    pub fn des_crypt_cbc(
        ctx: *mut des_context,
        mode: ::std::os::raw::c_int,
        length: ::std::os::raw::c_int,
        iv: *mut ::std::os::raw::c_uchar,
        input: *mut ::std::os::raw::c_uchar,
        output: *mut ::std::os::raw::c_uchar,
    );
}
unsafe extern "C" {
    #[doc = " \\brief          3DES-ECB block encryption/decryption\n\n \\param ctx      3DES context\n \\param input    64-bit input block\n \\param output   64-bit output block"]
    pub fn des3_crypt_ecb(
        ctx: *mut des3_context,
        input: *mut ::std::os::raw::c_uchar,
        output: *mut ::std::os::raw::c_uchar,
    );
}
unsafe extern "C" {
    #[doc = " \\brief          3DES-CBC buffer encryption/decryption\n\n \\param ctx      3DES context\n \\param mode     DES_ENCRYPT or DES_DECRYPT\n \\param length   length of the input data\n \\param iv       initialization vector (updated after use)\n \\param input    buffer holding the input data\n \\param output   buffer holding the output data"]
    pub fn des3_crypt_cbc(
        ctx: *mut des3_context,
        mode: ::std::os::raw::c_int,
        length: ::std::os::raw::c_int,
        iv: *mut ::std::os::raw::c_uchar,
        input: *mut ::std::os::raw::c_uchar,
        output: *mut ::std::os::raw::c_uchar,
    );
}
unsafe extern "C" {
    pub fn des_self_test(verbose: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
